app/Controllers/AuthController.php

SELECT `employes`.*, `roles`.`nom` as `role_name`, `departements`.`nom` as `departement_name`
FROM `employes`
LEFT JOIN `roles` ON `employes`.`role_id` = `roles`.`id`
LEFT JOIN `departements` ON `employes`.`departement_id` = `departements`.`id`
WHERE `employes`.`email` = 'koto.andry@example.com'
AND `employes`.`actif` = 1
 LIMIT 1
---
    public function login()
    {
        // Si déjà connecté, redirige vers son espace
        if (session()->has('user_id')) {
            $role = session()->get('user_role');
            return redirect()->to('/' . $role);
        }

        if ($this->request->is('post')) {
            $email = $this->request->getPost('email');
            $password = $this->request->getPost('password');

            try {
                // Cherche l'employé par email
                $employe = $this->employeModel
                    ->select('employes.*, roles.nom as role_name, departements.nom as departement_name')
                    ->join('roles', 'employes.role_id = roles.id', 'left')
                    ->join('departements', 'employes.departement_id = departements.id', 'left')
                    ->where('employes.email', $email)
                    ->where('employes.actif', true)
                    ->first();