app/Controllers/EmployeController.php

SELECT `employes`.*, `departements`.`nom` as `departement_name`
FROM `employes`
LEFT JOIN `departements` ON `employes`.`departement_id` = `departements`.`id`
WHERE `employes`.`id` = 3
---
    private function getUserData()
    {
        $userId = session()->get('user_id');
        $user = $this->employeModel
            ->select('employes.*, departements.nom as departement_name')
            ->join('departements', 'employes.departement_id = departements.id', 'left')
            ->find($userId);

SELECT `soldes`.*, `types_conges`.`nom`
FROM `soldes`
JOIN `types_conges` ON `soldes`.`type_conge_id` = `types_conges`.`id`
WHERE `soldes`.`employe_id` = 3
AND `soldes`.`annee` = '2026'
---
    private function getSoldesData(): array
    {
        $userId = session()->get('user_id');
        $annee = date('Y');

        $soldes = $this->soldeModel
            ->select('soldes.*, types_conges.nom')
            ->join('types_conges', 'soldes.type_conge_id = types_conges.id')
            ->where('soldes.employe_id', $userId)
            ->where('soldes.annee', $annee)
            ->findAll();

SELECT `conges`.*, `types_conges`.`nom` as `type_nom`, `status_conges`.`nom` as `status_nom`
FROM `conges`
JOIN `types_conges` ON `conges`.`type_conge_id` = `types_conges`.`id`
JOIN `status_conges` ON `conges`.`status_id` = `status_conges`.`id`
WHERE `conges`.`employe_id` = 3
ORDER BY `conges`.`created_at` DESC
---
    private function getDemandsData(): array
    {
        $userId = session()->get('user_id');

        $conges = $this->congeModel
            ->select('conges.*, types_conges.nom as type_nom, status_conges.nom as status_nom')
            ->join('types_conges', 'conges.type_conge_id = types_conges.id')
            ->join('status_conges', 'conges.status_id = status_conges.id')
            ->where('conges.employe_id', $userId)
            ->orderBy('conges.created_at', 'DESC')
            ->findAll();

SELECT `status_conges`.`id` as `status_id`, COUNT(*) as count
FROM `conges`
JOIN `status_conges` ON `conges`.`status_id` = `status_conges`.`id`
WHERE `conges`.`employe_id` = 3
GROUP BY `conges`.`status_id`
---
    public function dashboard()
    {
        $user = $this->getUserData();
        $userId = session()->get('user_id');
        $soldes = $this->getSoldesData();
        $demandes = $this->getDemandsData();

        // Calculs statistiques
        $stats = $this->congeModel
            ->select('status_conges.id as status_id, COUNT(*) as count')
            ->join('status_conges', 'conges.status_id = status_conges.id')
            ->where('conges.employe_id', $userId)
            ->groupBy('conges.status_id')
            ->findAll();

SELECT *
FROM `soldes`
WHERE `employe_id` = 3
AND `type_conge_id` = 1
AND `annee` = '2026'
 LIMIT 1
---
    public function congeCreate()
    {
        $user = $this->getUserData();
        $typeCongesModel = new TypeConges();
        $types = $typeCongesModel->findAll();

        $userId = session()->get('user_id');
        $annee = date('Y');

        $types_conge = [];
        foreach ($types as $type) {
            $solde = $this->soldeModel
                ->where('employe_id', $userId)
                ->where('type_conge_id', $type['id'])
                ->where('annee', $annee)
                ->first();

SELECT `status_conges`.`id` as `status_id`, COUNT(*) as count
FROM `conges`
JOIN `status_conges` ON `conges`.`status_id` = `status_conges`.`id`
WHERE `conges`.`employe_id` = 3
GROUP BY `conges`.`status_id`
---
    public function profil()
    {
        $user = $this->getUserData();
        $soldes = $this->getSoldesData();
        $userId = session()->get('user_id');

        $stats = $this->congeModel
            ->select('status_conges.id as status_id, COUNT(*) as count')
            ->join('status_conges', 'conges.status_id = status_conges.id')
            ->where('conges.employe_id', $userId)
            ->groupBy('conges.status_id')
            ->findAll();

UPDATE `employes` SET `nom` = 'Andry dzd', `prenom` = 'Koto vdfkjk'
WHERE `employes`.`id` IN (3)
---
    public function profilUpdate()
    {
        $userId = session()->get('user_id');

        $nom = $this->request->getPost('nom');
        $prenom = $this->request->getPost('prenom');

        if (!$nom || !$prenom) {
            return redirect()->to('/employe/profil')->with('error', 'Tous les champs sont requis.');
        }

        if ($this->employeModel->update($userId, ['nom' => $nom, 'prenom' => $prenom])) {