app/Controllers/RhController.php

    public function dashboard()
    {
        $db = db_connect();

        $anneeRow = $db->table('soldes')
            ->selectMax('annee')
            ->get()
            ->getRowArray();
        $annee = (int) ($anneeRow['annee'] ?? date('Y'));

        $statusAttente = $db->table('status_conges')
            ->select('id')
            ->where('nom', 'En attente')
            ->get()
            ->getRowArray();
        $statusApprouve = $db->table('status_conges')
            ->select('id')
            ->where('nom', 'Approuve')
            ->get()
            ->getRowArray();
        $statusRefuse = $db->table('status_conges')
            ->select('id')
            ->where('nom', 'Refuse')
            ->get()
            ->getRowArray();
---
SELECT MAX(`annee`) AS `annee`
FROM `soldes`
SELECT `id`
FROM `status_conges`
WHERE `nom` = 'En attente'
SELECT `id`
FROM `status_conges`
WHERE `nom` = 'Approuve'
SELECT `id`
FROM `status_conges`
WHERE `nom` = 'Refuse'

        $statusRefuseId = $statusRefuse['id'] ?? null;

        $nb_attente = $statusAttenteId
            ? $db->table('conges')->where('status_id', $statusAttenteId)->countAllResults()
            : 0;

        $nb_employes = $db->table('employes')->where('actif', 1)->countAllResults();

        $nb_approuvees = $statusApprouveId
            ? $db->table('conges')->where('status_id', $statusApprouveId)->countAllResults()
            : 0;

        $nb_refusees = $statusRefuseId
            ? $db->table('conges')->where('status_id', $statusRefuseId)->countAllResults()
---
SELECT COUNT(*) AS `numrows`
FROM `conges`
WHERE `status_id` = 1
SELECT COUNT(*) AS `numrows`
FROM `employes`
WHERE `actif` = 1
SELECT COUNT(*) AS `numrows`
FROM `conges`
WHERE `status_id` = 2
SELECT COUNT(*) AS `numrows`
FROM `conges`
WHERE `status_id` = 3


        $congesPrisRows = [];
        if ($statusApprouveId) {
            $congesPrisRows = $db->table('conges')
                ->select('employe_id, type_conge_id, SUM(nb_jours) as jours_pris')
                ->where('status_id', $statusApprouveId)
                ->groupBy('employe_id, type_conge_id')
                ->get()
                ->getResultArray();
---
SELECT `employe_id`, `type_conge_id`, SUM(nb_jours) as jours_pris
FROM `conges`
WHERE `status_id` = 2
GROUP BY `employe_id`, `type_conge_id`

            $congesPris[$key] = (int) ($row['jours_pris'] ?? 0);
        }

        $soldesRows = $db->table('soldes')
            ->select('employe_id, type_conge_id, jours_attribues, jours_pris')
            ->where('annee', $annee)
            ->get()
            ->getResultArray();
---
SELECT `employe_id`, `type_conge_id`, `jours_attribues`, `jours_pris`
FROM `soldes`
WHERE `annee` = 2025

            $soldes[$key] = $joursAttribues - $joursUtilises;
        }

        $rows = $db->table('conges c')
            ->select('c.id, c.employe_id, c.type_conge_id, c.date_debut, c.date_fin, c.nb_jours, c.status_id, c.traite_par')
            ->select('e.nom, e.prenom, d.nom as departement, tc.nom as type_conge')
            ->select('s.nom as statut_nom, tp.nom as traite_nom, tp.prenom as traite_prenom')
            ->join('employes e', 'e.id = c.employe_id', 'left')
            ->join('departements d', 'd.id = e.departement_id', 'left')
            ->join('types_conges tc', 'tc.id = c.type_conge_id', 'left')
            ->join('status_conges s', 's.id = c.status_id', 'left')
            ->join('employes tp', 'tp.id = c.traite_par', 'left')
            ->orderBy('c.date_debut', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT `c`.`id`, `c`.`employe_id`, `c`.`type_conge_id`, `c`.`date_debut`, `c`.`date_fin`, `c`.`nb_jours`, `c`.`status_id`, `c`.`traite_par`, `e`.`nom`, `e`.`prenom`, `d`.`nom` as `departement`, `tc`.`nom` as `type_conge`, `s`.`nom` as `statut_nom`, `tp`.`nom` as `traite_nom`, `tp`.`prenom` as `traite_prenom`
FROM `conges` `c`
LEFT JOIN `employes` `e` ON `e`.`id` = `c`.`employe_id`
LEFT JOIN `departements` `d` ON `d`.`id` = `e`.`departement_id`
LEFT JOIN `types_conges` `tc` ON `tc`.`id` = `c`.`type_conge_id`
LEFT JOIN `status_conges` `s` ON `s`.`id` = `c`.`status_id`
LEFT JOIN `employes` `tp` ON `tp`.`id` = `c`.`traite_par`
ORDER BY `c`.`date_debut` ASC

    public function demandes()
    {
        $db = db_connect();

        $anneeRow = $db->table('soldes')
            ->selectMax('annee')
            ->get()
            ->getRowArray();
        $annee = (int) ($anneeRow['annee'] ?? date('Y'));

        $statusApprouve = $db->table('status_conges')
            ->select('id')
            ->where('nom', 'Approuve')
            ->get()
            ->getRowArray();
        $statusApprouveId = $statusApprouve['id'] ?? null;

        $congesPrisRows = [];
        if ($statusApprouveId) {
            $congesPrisRows = $db->table('conges')
                ->select('employe_id, type_conge_id, SUM(nb_jours) as jours_pris')
                ->where('status_id', $statusApprouveId)
                ->groupBy('employe_id, type_conge_id')
                ->get()
                ->getResultArray();
---
SELECT MAX(`annee`) AS `annee`
FROM `soldes`
SELECT `id`
FROM `status_conges`
WHERE `nom` = 'Approuve'
SELECT `employe_id`, `type_conge_id`, SUM(nb_jours) as jours_pris
FROM `conges`
WHERE `status_id` = 2
GROUP BY `employe_id`, `type_conge_id`

            $congesPris[$key] = (int) ($row['jours_pris'] ?? 0);
        }

        $soldesRows = $db->table('soldes')
            ->select('employe_id, type_conge_id, jours_attribues, jours_pris')
            ->where('annee', $annee)
            ->get()
            ->getResultArray();
---
SELECT `employe_id`, `type_conge_id`, `jours_attribues`, `jours_pris`
FROM `soldes`
WHERE `annee` = 2025

            $soldes[$key] = $joursAttribues - $joursUtilises;
        }

        $rows = $db->table('conges c')
            ->select('c.id, c.employe_id, c.type_conge_id, c.date_debut, c.date_fin, c.nb_jours, c.status_id, c.traite_par')
            ->select('e.nom, e.prenom, d.nom as departement, tc.nom as type_conge')
            ->select('s.nom as statut_nom, tp.nom as traite_nom, tp.prenom as traite_prenom')
            ->join('employes e', 'e.id = c.employe_id', 'left')
            ->join('departements d', 'd.id = e.departement_id', 'left')
            ->join('types_conges tc', 'tc.id = c.type_conge_id', 'left')
            ->join('status_conges s', 's.id = c.status_id', 'left')
            ->join('employes tp', 'tp.id = c.traite_par', 'left')
            ->orderBy('c.created_at', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT `c`.`id`, `c`.`employe_id`, `c`.`type_conge_id`, `c`.`date_debut`, `c`.`date_fin`, `c`.`nb_jours`, `c`.`status_id`, `c`.`traite_par`, `e`.`nom`, `e`.`prenom`, `d`.`nom` as `departement`, `tc`.`nom` as `type_conge`, `s`.`nom` as `statut_nom`, `tp`.`nom` as `traite_nom`, `tp`.`prenom` as `traite_prenom`
FROM `conges` `c`
LEFT JOIN `employes` `e` ON `e`.`id` = `c`.`employe_id`
LEFT JOIN `departements` `d` ON `d`.`id` = `e`.`departement_id`
LEFT JOIN `types_conges` `tc` ON `tc`.`id` = `c`.`type_conge_id`
LEFT JOIN `status_conges` `s` ON `s`.`id` = `c`.`status_id`
LEFT JOIN `employes` `tp` ON `tp`.`id` = `c`.`traite_par`
ORDER BY `c`.`created_at` DESC

        $nb_approuvees = count(array_filter($demandes, static fn ($d) => $d['statut'] === 'approuvee'));
        $nb_refusees = count(array_filter($demandes, static fn ($d) => $d['statut'] === 'refusee'));

        $departementsRows = $db->table('departements')
            ->select('nom')
            ->orderBy('nom', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT `nom`
FROM `departements`
ORDER BY `nom` ASC